In [1]:
import pandas as pd
pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)

url = 'https://github.com/HamoyeHQ/HDSC-Introduction-to-Python-for-machine-learning/files/7768140/FoodBalanceSheets_E_Africa_NOFLAG.csv'
agri_data = pd.read_csv(url, encoding="latin-1")
agri_data.describe(include='all')

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
count,60943.000000,60943,60943.000000,60943,60943.000000,60943,60943,59354.000000,59395.000000,59408.000000,59437.000000,59507.000000
unique,NaN,49,NaN,119,NaN,18,5,NaN,NaN,NaN,NaN,NaN
top,NaN,Kenya,NaN,Milk - Excluding Butter,NaN,Domestic supply quantity,1000 tonnes,NaN,NaN,NaN,NaN,NaN
freq,NaN,1560,NaN,1262,NaN,5295,40933,NaN,NaN,NaN,NaN,NaN
mean,134.265576,NaN,2687.176706,NaN,3814.856456,NaN,NaN,134.196282,135.235966,136.555222,140.917765,143.758381
std,72.605709,NaN,146.055739,NaN,2212.007033,NaN,NaN,1567.663696,1603.403984,1640.007194,1671.862359,1710.782658
min,4.000000,NaN,2501.000000,NaN,511.000000,NaN,NaN,-1796.000000,-3161.000000,-3225.000000,-1582.000000,-3396.000000
25%,74.000000,NaN,2562.000000,NaN,684.000000,NaN,NaN,0.000000,0.000000,0.000000,0.000000,0.000000
50%,136.000000,NaN,2630.000000,NaN,5142.000000,NaN,NaN,0.090000,0.080000,0.080000,0.100000,0.070000
75%,195.000000,NaN,2775.000000,NaN,5511.000000,NaN,NaN,8.340000,8.460000,8.430000,9.000000,9.000000
max,276.000000,NaN,2961.000000,NaN,5911.000000,NaN,NaN,176405.000000,181137.000000,185960.000000,190873.000000,195875.000000

In [2]:
agri_data.head()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.00,39728.00,40551.00,41389.00,42228.00
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.00,0.00,0.00,0.00,0.00
2,4,Algeria,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,3377.00,3379.00,3372.00,3341.00,3322.00
3,4,Algeria,2901,Grand Total,674,Protein supply quantity (g/capita/day),g/capita/day,94.90,94.35,94.72,92.82,91.83
4,4,Algeria,2901,Grand Total,684,Fat supply quantity (g/capita/day),g/capita/day,80.06,79.36,77.40,80.19,77.28

In [3]:
agri_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60943 entries, 0 to 60942
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Area Code     60943 non-null  int64
 1   Area          60943 non-null  object
 2   Item Code     60943 non-null  int64
 3   Item          60943 non-null  object
 4   Element Code  60943 non-null  int64
 5   Element       60943 non-null  object
 6   Unit          60943 non-null  object
 7   Y2014         59354 non-null  float64
 8   Y2015         59395 non-null  float64
 9   Y2016         59408 non-null  float64
 10  Y2017         59437 non-null  float64
 11  Y2018         59507 non-null  float64
dtypes: float64(5), int64(3), object(4)
memory usage: 5.6+ MB

In [4]:
#q1 - What year has the highest sum of Stock Variation?
agri_data['Element'].unique()

array(['Total Population - Both sexes', 'Domestic supply quantity',
       'Food supply (kcal/capita/day)',
       'Protein supply quantity (g/capita/day)',
       'Fat supply quantity (g/capita/day)', 'Production',
       'Import Quantity', 'Stock Variation', 'Export Quantity', 'Feed',
       'Seed', 'Losses', 'Processing', 'Other uses (non-food)',
       'Residuals', 'Food', 'Food supply quantity (kg/capita/yr)',
       'Tourist consumption'], dtype=object)

In [5]:
# Filter the DataFrame to include only rows where the 'Element' is 'Stock Variation'
stock_variation_df = agri_data[agri_data['Element'] == 'Stock Variation']

# Group by the years and calculate the sum for each year
grouped_sum_year = stock_variation_df[['Y2014', 'Y2015', 'Y2016', 'Y2017', 'Y2018']].sum()

grouped_sum_year

Y2014    58749.83
Y2015    34910.99
Y2016    33140.12
Y2017    54316.91
Y2018    20577.91
dtype: float64

In [6]:
#q2
S = [['him', 'sell'], [90, 28, 43]]

S[0][1][1]

'e'

In [7]:
#q3- Mean and SD for 2017

mean_y2017 = agri_data['Y2017'].mean()
std_y2017 = agri_data['Y2017'].std()

# Round the values to 2 decimal places
mean_y2017 = round(mean_y2017, 2)
std_y2017 = round(std_y2017, 2)

print(mean_y2017)
print(std_y2017)

140.92
1671.86

In [8]:
#q4-Which of these Areas had the 7th lowest sum in 2017

cols = agri_data[['Y2017', 'Area']]

# Group the data by 'Area' and calculate the sum of 'Y2017'
sum_by_area = cols.groupby('Area')['Y2017'].sum()

# Sort the sums in ascending order
sum_sorted = sum_by_area.sort_values().reset_index()
sum_sorted.head(10)

                    Area     Y2017
0         Sudan (former)      0.00
1           Ethiopia PDR      0.00
2                Comoros     59.84
3             Seychelles    442.34
4  Sao Tome and Principe  12662.63
5             Cabo Verde  14650.74
6          Guinea-Bissau  19102.77
7                Lesotho  21267.96
8               Botswana  22101.30
9               Djibouti  22729.91

In [9]:
#q6 - total number of the sum of Processing in 2017

processing_df = agri_data[agri_data['Element'] == 'Processing']

# Group by the years and calculate the sum for each year
grouped_sum_year = processing_df[['Y2014', 'Y2015', 'Y2016', 'Y2017', 'Y2018']].sum()

grouped_sum_year

Y2014    282923.0
Y2015    287929.0
Y2016    280631.0
Y2017    292836.0
Y2018    308429.0
dtype: float64

In [10]:
#q8 - check for the number of rows and columns in a pandas DataFrame
agri_data.shape

(60943, 12)

In [11]:
#q9 - assign element 8 from the list to a variable x
y = [(2, 4), (7, 8), (1, 5, 9)]

x = y[1][-1]
x2 = y[1][1]
print(x)
print(x2)

8
8

In [12]:
#q10 - missing data in 2014 column

missing_values = agri_data['Y2014'].isnull().sum()
total_rows = len(agri_data)

# Calculate the percentage of missing data
percentage_missing = (missing_values / total_rows) * 100

print(missing_values)
print(round(percentage_missing, 3), "%")

1589
2.607 %

In [13]:
#q11 - year with least correlation with 'Element Code'

selected_columns = agri_data[['Element Code', 'Y2014', 'Y2015', 'Y2016', 'Y2017', 'Y2018']]

# Calculate correlation matrix
correlation_matrix = selected_columns.corr()

correlation_matrix

              Element Code     Y2014     Y2015     Y2016     Y2017     Y2018
Element Code      1.000000  0.024457  0.023889  0.023444  0.024254  0.024279
Y2014             0.024457  1.000000  0.994647  0.996081  0.995230  0.994872
Y2015             0.023889  0.994647  1.000000  0.995739  0.988048  0.988208
Y2016             0.023444  0.996081  0.995739  1.000000  0.992785  0.992757
Y2017             0.024254  0.995230  0.988048  0.992785  1.000000  0.998103
Y2018             0.024279  0.994872  0.988208  0.992757  0.998103  1.000000

In [14]:
#q12 - Which of the Areas had the highest sum in 2017?

cols = agri_data[['Y2017', 'Area']]

# Group the data by 'Area' and calculate the sum of 'Y2017'
sum_by_area = cols.groupby('Area')['Y2017'].sum()
sum_by_area = sum_by_area.sort_values(ascending=False)
sum_by_area

Area
Nigeria                        1483268.23
Egypt                           866379.92
South Africa                    517590.54
Ethiopia                        448683.76
Morocco                         388495.36
Ghana                           337599.06
Algeria                         325644.27
United Republic of Tanzania     322616.85
Kenya                           264660.66
Sudan                           239931.92
Cameroon                        232030.43
Angola                          229159.57
CÃ´te d'Ivoire                   224599.01
Uganda                          213950.38
Malawi                          181098.71
Mozambique                      161407.98
Mauritania                      156665.46
Mali                            149928.33
Madagascar                      131197.73
Niger                           126707.58
Benin                           124771.22
Tunisia                         124167.20
Zambia                          103223.77
Burkina Faso                    101855.07
Guinea                           98138.87
Senegal                          95681.15
Zimbabwe                         75919.34
Rwanda                           73663.69
Chad                             71594.68
Sierra Leone                     55311.33
Eswatini                         54343.33
Mauritius                        51114.83
Togo                             49841.88
Congo                            41181.68
Central African Republic         29937.00
Namibia                          29874.89
Liberia                          29342.20
Gabon                            27979.64
Gambia                           23154.18
Djibouti                         22729.91
Botswana                         22101.30
Lesotho                          21267.96
Guinea-Bissau                    19102.77
Cabo Verde                       14650.74
Sao Tome and Principe            12662.63
Seychelles                         442.34
Comoros                             59.84
Sudan (former)                       0.00
Ethiopia PDR                         0.00
Name: Y2017, dtype: float64

In [15]:
#q13 - select  the elements in bold and italics from the array

array = [[94, 89, 63],
         [93, 92, 48],
         [92, 94, 56]]

bold_italic = array[0][1:] + array[1][1:]
bold_italic

[89, 63, 92, 48]

In [16]:
#q16 - Perform a groupby sum aggregation on Item

# Group by 'Item' and calculate the sum for '2015' and '2018'
grouped_sum = agri_data.groupby('Item')[['Y2015', 'Y2018']].sum()

grouped_sum.tail()

                        Y2015      Y2018
Item
Vegetables, Other   158104.08  163987.21
Vegetal Products    107064.17  107775.39
Wheat and products  234710.51  242645.19
Wine                  4251.81    4039.32
Yams                203151.78  221272.09

In [17]:
#q17 - type error
my_tuppy = (1,2,5,8)

my_tuppy[2] = 6

#tuple is immutable

TypeError: 'tuple' object does not support item assignment

In [18]:
#q18 - create dataframe
lst = [[35, 'Portugal', 94], [33, 'Argentina', 93], [30 , 'Brazil', 92]]
col = ['Age','Nationality','Overall']

df = pd.DataFrame(lst, columns=col, index=[1,2,3])
df

   Age Nationality  Overall
1   35    Portugal       94
2   33   Argentina       93
3   30      Brazil       92

In [20]:
#q19 -total protein supply quantity in madagascar in 2015
agri_data['Element'].unique()

array(['Total Population - Both sexes', 'Domestic supply quantity',
       'Food supply (kcal/capita/day)',
       'Protein supply quantity (g/capita/day)',
       'Fat supply quantity (g/capita/day)', 'Production',
       'Import Quantity', 'Stock Variation', 'Export Quantity', 'Feed',
       'Seed', 'Losses', 'Processing', 'Other uses (non-food)',
       'Residuals', 'Food', 'Food supply quantity (kg/capita/yr)',
       'Tourist consumption'], dtype=object)

In [21]:
# Filter the DataFrame to include only rows where the 'Area' is 'Madagascar'
madagascar_2015 = agri_data[agri_data['Area'] == 'Madagascar']

# Group by 'Element' and calculate the sum for 'Y2015'
grouped_sum_2015 = madagascar_2015.groupby('Element')['Y2015'].sum()

grouped_sum_2015

Element
Domestic supply quantity                  31214.98
Export Quantity                             494.75
Fat supply quantity (g/capita/day)           91.85
Feed                                       2070.22
Food                                      21120.65
Food supply (kcal/capita/day)              7685.00
Food supply quantity (kg/capita/yr)         871.59
Import Quantity                            1721.80
Losses                                     2176.00
Other uses (non-food)                      3957.12
Processing                                 1803.00
Production                                29482.89
Protein supply quantity (g/capita/day)      173.05
Residuals                                  -616.00
Seed                                        699.00
Stock Variation                            -505.00
Total Population - Both sexes             24234.00
Name: Y2015, dtype: float64

In [22]:
#q20 - unique number of countries

unique_countries = agri_data['Area'].nunique()
unique_countries

49